{
  "basics": {
    "name": "Piotr Szymański",
    "label": "Engineer",
    "picture": "",
    "email": "p.szymanski@bidpy.pl",
    "phone": "",
    "website": "https://eddwardo.github.io",
    "summary": "I define problems before solving them. Beside being Software Engineer, DevOPS or OPS, I also like to develop myself in: infosec, machine learning and blockchain related technologies.<br /><br />tags: linux, python, aws, celery, django, pytest, uwsgi, fabric, pandas, twisted, jinja2, ansible, postgresql, mariadb, mysql, redis, mongodb, rabbitmq, kafka, terraform, puppet, foreman, shippable, circleci, jenkins, docker, datadog, graphite, graphana, logentries, security, erlang, elixir, swift, tensorflow, scikit-learn",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Wrocław",
      "countryCode": "PL",
      "region": "Europe"
    },
    "profiles": [
      {

        "network": "stack-overflow",
        "username": "eddd",
        "url": "https://stackoverflow.com/users/1366719/eddd"
      },
      {
        "network": "github",
        "username": "eddwaro",
        "url": "https://github.com/eddwardo"
      },
      {
        "network": "linkedin",
        "username": "piotr-szymanski-bidpy",
        "url": "https://www.linkedin.com/in/piotr-szymanski-bidpy/"
      }
    ]
  },
  "work": [
    {
      "company": "FieldAware (Remote)",
      "position": "DevOps team lead",
      "wesdbsite": "https://fieldaware.com",
      "startDate": "2015-03-01",
      "summary": "Joined as Senior Software Engineer. Focused on refactoring the monolith into service based architecture. Changed the direction to DevOps role and DevOps team lead.",
      "highlights": [
  "Work on AWS infrastructure: EC2, ECS, IAM, S3, KMS, CloudWatch, Lambda, RDS, Dynamo, VPC, Route53 etc.",
  "Managed production infrastructure with terraform (IAC). Code changes were driven entirely by git workflow. Terraform plans were posted as PR comments, merges caused applies.",
	"Refactor codebase to run with Docker and orchestrate it with ECS",
	"Implemented internal tools for managing configuration and releases. (https://github.com/fieldaware/confgen)",
	"Recreated from scratch the CI and CD pipeline with Docker (CircleCI, Shippable), resulting with reproducible builds executable from any environment.",
	"Added features and fixes to the existing system (Python) ~ 50K SLOC",
	"Improved production runtime of python services with uWSGI. Plugins, worker lifecycle management, serving static assets etc.",
	"Maintained and develop infrastructure with puppet and foreman (100+ EC2 instances)",
	"Built deployment and infra management tools with ansible",
	"Monitoring improvements (dashboards, metrics) - DataDog, logentries, CloudWatch"
      ]
    },
    {
      "company": "F-Secure (Remote)",
      "position": "Senior Software Engineer",
      "wesdbsite": "https://f-secure.com",
      "startDate": "2013-10-01",
      "endDate": "2014-11-01",
      "summary": "Developed complex, big scale content system (similar to Dropbox). Working with multinational agile team based in Helsinki, mostly remotely from Poland.",
      "highlights": [
	"Implemented various features in Python and PL/SQL",
	"Refactored tests responsible for finding flaws in high availability setup",
	"Stabilized the code base to make it more predictable build wise"
      ]
    },
    {
      "company": "ClearCode",
      "position": "Software Engineer",
      "wesdbsite": "https://kanary.co",
      "startDate": "2012-07-01",
      "endDate": "2013-10-01",
      "summary": "Design and develop a DSP (demend site platform) for RTB environment. 5K+ RPS on t2.medium",
      "highlights": [
	"Implemented core backend server with Python (Twisted, asyncio) and Redis",
	"Introduced TDD approach to the team (pytest, unit and integration)",
	"Modeled the reporting system based on RabbitMQ and MongoDB"
      ]
    },
    {
      "company": "BusinessClick",
      "position": "Python developer",
      "wesdbsite": "https://businessclick.com",
      "startDate": "2011-10-01",
      "endDate": "2012-09-01",
      "summary": "Joined small team of developers to build advertising platform. At its peak system served 300 RPS on average, which was half of the Polish web at the time.",
      "highlights": [
        "Implemented new features for system frontend with Python/HTML/JavaScript",
	"Improved and bug fixed core system with Python and PL/SQL"
      ]
    },
    {
      "company": "MyStock.pl",
      "position": "Internship",
      "wesdbsite": "https://mystock.pl",
      "startDate": "2011-07-01",
      "endDate": "2012-09-01",
      "summary": "Tasked to learn how production systems written in Python work. Worked with production system with heavy load",
      "highlights": [
	"Maintain bridge between the production and Polish Stock Exchange",
	"Refactored start up scripts",
	"Patched bugs"
      ]
    }
  ],
  "education": [
    {
      "institution": "Wrocław University of Technology (Politechnika Wrocławska)",
      "area": "Computer Science, Electronics",
      "studyType": "Engineer",
      "startDate": "2007-10-01",
      "endDate": "2011-10-01",
      "gpa": "4.6"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Working in English speaking teams since 2013"
    },
    {
      "language": "German",
      "fluency": "I find it really interesting but I cannot hold to a conversation yet"
    },
    {
      "language": "Polish",
      "fluency": "Native"
    }
  ],
  "interests": [
    {"name": "philosophy"},
    {"name": "snowboarding"},
    {"name": "boxing"},
    {"name": "economics"},
    {"name": "psychology"},
    {"name": "ukulele"},
    {"name": "meditation"}
  ]
}
